/* class vs object
*만약 class나 object가 없다면 많은 변수들이 정리가 되지않고 둥둥떠나셧을것!

*class는 조금 더 연관있는 데이터를 묶어두는 콘테이너 역할을 한다.
*class안에는 이름과 나이같은 속성, field 가 있고 행동 method가 존재한다
 즉 클래스는 연관있는 fields들과 method 가 종합적으로 묶여있는것을 말한다. method없이 field만 묶여있는 class도 있느데
 이러한 class를 data class 라고 한다.

* 이 class 안에서도 내부적으로 사용하는 변수와 외부에서보일 수 있는 변수를 나누는데 이런것을 캡슐화라고 한다. 
 클래스를 이용해서 상속과 다양성이 일어날 수 있는데 이러한 모든것들이 일어날 수 있는것이 객체지향언어이다.class나

*우리가 실제로살아가는 세상에는 수많은 물체와 사물이 존재. 프로그레ㅐ밍을 할때도 이러한 사물과 물체를 class로 정의해서 프로그래밍하는것이
더욱자연스럽기 때문에 유연하고 편하게 개발할 수 있다.


Class는 붕어빵을 예로 들었을 때, class는 붕어빵을 만들 수 있는 틀과 같다.그래서 청사진이라고도 불리고 template이라고 한다.
그 틀안에는 데이터는 없고 틀만 정의해서 해두고  한번만 선언해서 사용한다.
실제로 클래스를 이용해서 실제로 데이터를 넣어서 만드는것이 object이다.
class를 이용해서 새로운 instance를 생성하면 object가 된다.

object는 class를 이용해서 수백개를 만들 수 있고
class는 정의만 해둔것이라 실제로 메모리에 올라가지는 않으나 object는 메모리에 올라간다

붕어빵으로 에를들면 clss에 데이터를 넣어 만들어낸 그러니까 붕어빵 그자체는 object가 되고 붕어빵의 틀은 class가 된다.

*/

